tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "minio/stable"
tap "romkatv/powerlevel10k"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Debugger for the Go programming language
brew "delve"
# Debian package management system
brew "dpkg"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Library access to GnuPG
brew "gpgme"
# Image processing tools collection
brew "graphicsmagick"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Free Kerberos 5 implementation
brew "heimdal"
# Configurable static site generator
brew "hugo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Conversion library
brew "libiconv"
# Make/rake-like build tool using Go
brew "mage"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@13"
# Theme for zsh
brew "powerlevel10k"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Emulator for x86 and PowerPC
brew "qemu"
# Ruby version manager
brew "rbenv"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Persistent key-value database, with built-in net interface
brew "redis"
# Collection of tools for managing UNIX services
brew "runit"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Programmatically correct mistyped console commands
brew "thefuck"
# CLI tool that moves files or folder to the trash
brew "trash"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# High Performance Object Storage compatible with Amazon S3 API
brew "minio/stable/minio"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Open source container development tool
cask "finch"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Free and open-source image editor
cask "gimp"
# Game development engine
cask "godot"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
mas "Xcode", id: 497799835
vscode "albert.TabOut"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "jinliming2.vscode-go-template"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "Vue.volar"
vscode "waderyan.gitblame"
vscode "zxh404.vscode-proto3"
